source/_static/diagrams/13-how-a-build-executes-2.d2
direction: right
n0: "fetch"
n1: "extract"
n2: "patch"
n3: "configure"
n4: "build"
n5: "install"
n6: "test"
n0 -> n1
n1 -> n2
n2 -> n3
n3 -> n4
n4 -> n5
n5 -> n6
